Catalogs/ДатаМобайл_Роли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДатаМобайл_Роли</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДатаМобайл_Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Права</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Право</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляТСД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Шаблоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДатаМобайл_ШаблоныДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДатаМобайл_Роли/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьПрава();		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.ДатаМобайл_Пользователи.ФормаВыбора" Тогда
		ДобавитьПользователей(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ДатаМобайл_ШаблоныДокументов.ФормаВыбора" Тогда
		ДобавитьШаблоны(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПраваПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователя(Команда)
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("МножественныйВыбор"	, Истина);
	ПараметрыПодбора.Вставить("РежимВыбора"			, Истина);
	Подбор = Получитьформу("Справочник.ДатаМобайл_Пользователи.ФормаВыбора", ПараметрыПодбора, ЭтаФорма);
	Подбор.ЗакрыватьПривыборе = Истина;
	Подбор.Открыть();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПользователей(ВыбранноеЗначение)
	
	ПараметрыОтбора = Новый Структура;
	ПользователиТСД = Объект.Пользователи;
	
	Для каждого Значение Из ВыбранноеЗначение Цикл
		ПараметрыОтбора.Вставить("Пользователь", Значение);
		НайденныеСтроки = ПользователиТСД.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Стр = ПользователиТСД.Добавить();
			Стр.Пользователь = Значение;
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьШаблоны(ВыбранноеЗначение)
	
	ПараметрыОтбора = Новый Структура;
	Шаблоны = Объект.Шаблоны;
	
	Для каждого Значение Из ВыбранноеЗначение Цикл
		ПараметрыОтбора.Вставить("Шаблон", Значение);
		НайденныеСтроки = Шаблоны.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Стр = Шаблоны.Добавить();
			Стр.Шаблон = Значение;
		КонецЕсли; 		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблон(Команда)
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("МножественныйВыбор"	, Истина);
	ПараметрыПодбора.Вставить("РежимВыбора"			, Истина);
	Подбор = Получитьформу("Справочник.ДатаМобайл_ШаблоныДокументов.ФормаВыбора", ПараметрыПодбора, ЭтаФорма);
	Подбор.ЗакрыватьПривыборе = Истина;
	Подбор.Открыть();
КонецПроцедуры

&НаСервере
Процедура ДобавитьПрава()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ДляТСД", "");
	
	ТЧПрава = Объект.Права;	
	
	//"Настройки приложения"
	
	СтруктураПоиска.ДляТСД = "is_allow_settings";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Настройки приложения";
		СтрТЧ.ДляТСД = "is_allow_settings";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	
	
	//"Настройки шаблонов"
	
	СтруктураПоиска.ДляТСД = "is_allow_template_settings";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
		
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Настройки шаблонов";
		СтрТЧ.ДляТСД = "is_allow_template_settings";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли; 
	
	//"Создание товара"
	
	СтруктураПоиска.ДляТСД = "is_allow_create_arts";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
		
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Создание товара";
		СтрТЧ.ДляТСД = "is_allow_create_arts";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;

	//"Изменение/удаление товара"
	
	СтруктураПоиска.ДляТСД = "is_allow_edit_arts";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Изменение/удаление товара";
		СтрТЧ.ДляТСД = "is_allow_edit_arts";
		СтрТЧ.Пометка = Истина; 
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
	//"Создание ШК"
	
	СтруктураПоиска.ДляТСД = "is_allow_create_barcodes";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Создание ШК";
		СтрТЧ.ДляТСД = "is_allow_create_barcodes";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
	//"Изменение/удаление ШК"
	
	СтруктураПоиска.ДляТСД = "is_allow_edit_barcodes";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Изменение/удаление ШК";
		СтрТЧ.ДляТСД = "is_allow_edit_barcodes";
		СтрТЧ.Пометка = Истина; 
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	

	//"Цена товара"
	
	СтруктураПоиска.ДляТСД = "is_allow_view_price";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Цена товара";
		СтрТЧ.ДляТСД = "is_allow_view_price";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	

	//"Документы"
	
	СтруктураПоиска.ДляТСД = "is_allow_docs";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Документы";
		СтрТЧ.ДляТСД = "is_allow_docs";
		СтрТЧ.Пометка = Истина; 
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;	

	//"Создание документов"
	
	СтруктураПоиска.ДляТСД = "is_allow_create_docs";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 

		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Создание документов";
		СтрТЧ.ДляТСД = "is_allow_create_docs";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
			
    //"Удаление документов"
	
	СтруктураПоиска.ДляТСД = "is_allow_delete_docs";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Удаление документов";
		СтрТЧ.ДляТСД = "is_allow_delete_docs";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;

    //"Быстрый доступ"
	
	СтруктураПоиска.ДляТСД = "is_allow_fast_access";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Быстрый доступ";
		СтрТЧ.ДляТСД = "is_allow_fast_access";
		СтрТЧ.Пометка = Истина; 
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;    
	
	//"Печать"
	
	СтруктураПоиска.ДляТСД = "is_allow_print";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Печать";
		СтрТЧ.ДляТСД = "is_allow_print";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;

	//"Лицензия"
	
	СтруктураПоиска.ДляТСД = "is_allow_license_settings";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Лицензия";
		СтрТЧ.ДляТСД = "is_allow_license_settings";
		СтрТЧ.Пометка = Истина; 
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
    //"Остаток товара"
	
	СтруктураПоиска.ДляТСД = "is_allow_view_rest";	
	МассивСтрок = ТЧПрава.НайтиСтроки(СтруктураПоиска);
	
	Если МассивСтрок.Количество() = 0 Тогда 
	
		СтрТЧ = ТЧПрава.Добавить();
		СтрТЧ.Право = "Остаток товара";
		СтрТЧ.ДляТСД = "is_allow_view_rest";
		СтрТЧ.Пометка = Истина;
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
